In [2]:
import pandas as pd

In [8]:
df = pd.read_csv("sales.csv", index_col="month")


simplest indexing is by column x row

df["col_name"]["row_label"]

In [9]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [10]:
df["salt"]["Jan"]

12.0

In [11]:
df.eggs["Mar"]

221

### indexing using accessors

- .loc
- .iloc

In [15]:
#df.loc["row_label", "col_label"]
df.loc["May", "spam"]

52

In [14]:
#df.iloc[row, col]
#zero based indexing
df.iloc[4,2]

52

In [18]:
#nested list to ensure the return result is data frame
df[["salt", "eggs"]]

       salt  eggs
month
Jan    12.0    47
Feb    50.0   110
Mar    89.0   221
Apr    87.0    77
May     NaN   132
Jun    60.0   205

### index ordering

In this exercise, the DataFrame election is provided for you. It contains the 2012 US election results for the state of Pennsylvania with county names as row indices. Your job is to select 'Bedford' county and the'winner' column. Which method is the preferred way?

In [ ]:
# best way to select as follows"
# election.loc["row_label", "col_label"]
election.loc["Bedford", "winner"]

## Positional and labeled indexing
Given a pair of label-based indices, sometimes it's necessary to find the corresponding positions. In this exercise, you will use the Pennsylvania election results again. The DataFrame is provided for you as election.

Find x and y such that election.iloc[x, y] == election.loc['Bedford', 'winner']. That is, what is the row position of 'Bedford', and the column position of 'winner'? Remember that the first position in Python is 0, not 1!

To answer this question, first explore the DataFrame using election.head() in the IPython Shell and inspect it with your eyes.

This course introduces a lot of new concepts, so if you ever need a quick refresher, download the Pandas Cheat Sheet and keep it handy!

- Explore the DataFrame in the IPython Shell using election.head().
- Assign the row position of election.loc['Bedford'] to x.
- Assign the column position of election['winner'] to y.

In [ ]:
# Assign the row position of election.loc['Bedford']: x
x = 4

# Assign the column position of election['winner']: y
y = 4

# Print the boolean equivalence
print(election.iloc[x, y] == election.loc['Bedford', 'winner'])

## Indexing and column rearrangement
There are circumstances in which it's useful to modify the order of your DataFrame columns. We do that now by extracting just two columns from the Pennsylvania election results DataFrame.

Your job is to read the CSV file and set the index to 'county'. You'll then assign a new DataFrame by selecting the list of columns ['winner', 'total', 'voters']. The CSV file is provided to you in the variable filename.

- Import pandas as pd.
- Read in filename using pd.read_csv() and set the index to 'county' by specifying the index_col parameter.
- Create a separate DataFrame results with the columns ['winner', 'total', 'voters'].
- Print the output using results.head(). This has been done for you, so hit 'Submit Answer' to see the new DataFrame!

In [1]:
# Import pandas
import pandas as pd
filename = "pennsylvania2012_turnout.csv"
# Read in filename and set the index: election
election = pd.read_csv(filename, index_col='county')

# Create a separate dataframe with the columns ['winner', 'total', 'voters']: results
results = election[['winner', 'total', 'voters']]

# Print the output of results.head()
print(results.head())

           winner   total  voters
county
Adams      Romney   41973   61156
Allegheny   Obama  614671  924351
Armstrong  Romney   28322   42147
Beaver     Romney   80015  115157
Bedford    Romney   21444   32189

In [11]:
df = pd.read_csv("sales.csv", index_col = "month")

In [12]:
df.head()

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52

#### selecting a column

In [13]:
#by default a column is selected
df["eggs"]

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

#### slicing and indexing a series

In [14]:
# slice starts with 0  
df["eggs"][1:4]

month
Feb    110
Mar    221
Apr     77
Name: eggs, dtype: int64

In [15]:
df["eggs"][4]

132

#### slicing with .loc
#### all rows and some columns

In [16]:
df.loc[:, "eggs":"salt"] #all rows and some columns

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

#### some rows and all columns

In [17]:
df.loc["Jan":"Apr", :]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20

#### some rows and some columns

In [19]:
df.loc["Mar":"May", "salt":"spam"]

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

### slicing using .iloc accessor

omitting any of the slice parameters means the slicing either starts from the beginning or ends at the very last element of a row or a column

In [20]:
df.iloc[2:5,1:]

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

### using lists rather than slices with the .loc accessor

In [21]:
df.loc["Jan":"Mar", ["eggs", "spam"]]

       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72

### using list rather than slices with the .iloc accessor

In [22]:
df.iloc[[0,4,5], 0:2]

       eggs  salt
month
Jan      47  12.0
May     132   NaN
Jun     205  60.0

In [24]:
# this will yield Series as result
type(df["eggs"])

pandas.core.series.Series

In [25]:
# this will yield data frame as result
type(df[["eggs"]])

pandas.core.frame.DataFrame

### Slicing rows
The Pennsylvania US election results data set that you have been using so far is ordered by county name. This means that county names can be sliced alphabetically. In this exercise, you're going to perform slicing on the county names of the election DataFrame from the previous exercises, which has been pre-loaded for you.

- Slice the row labels 'Perry' to 'Potter' and assign the output to p_counties.
- Print the p_counties DataFrame. This has been done for you.
- Slice the row labels 'Potter' to 'Perry' in reverse order. To do this for hypothetical row labels 'a' and 'b', you could use a stepsize of -1 like so: df.loc['b':'a':-1].
- Print the p_counties_rev DataFrame. This has also been done for you, so hit 'Submit Answer' to see the result of your slicing!

In [26]:
filename = "pennsylvania2012_turnout.csv"
# Read in filename and set the index: election
election = pd.read_csv(filename, index_col='county')

In [27]:
election.head()

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Adams,PA,41973,35.482334,63.112001,Romney,61156,68.632677,27.629667
Allegheny,PA,614671,56.640219,42.185820,Obama,924351,66.497575,14.454399
Armstrong,PA,28322,30.696985,67.901278,Romney,42147,67.198140,37.204293
Beaver,PA,80015,46.032619,52.637630,Romney,115157,69.483401,6.605012
Bedford,PA,21444,22.057452,76.986570,Romney,32189,66.619031,54.929118

In [28]:
p_counties = election["Perry":"Potter"]
p_counties

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Perry,PA,18240,29.769737,68.591009,Romney,27245,66.948064,38.821272
Philadelphia,PA,653598,85.224251,14.051451,Obama,1099197,59.461407,71.172800
Pike,PA,23164,43.904334,54.882576,Romney,41840,55.363289,10.978242
Potter,PA,7205,26.259542,72.158223,Romney,10913,66.022175,45.898681

In [29]:
p_counties_rev = election.loc["Potter":"Perry":-1]
p_counties_rev

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Potter,PA,7205,26.259542,72.158223,Romney,10913,66.022175,45.898681
Pike,PA,23164,43.904334,54.882576,Romney,41840,55.363289,10.978242
Philadelphia,PA,653598,85.224251,14.051451,Obama,1099197,59.461407,71.172800
Perry,PA,18240,29.769737,68.591009,Romney,27245,66.948064,38.821272

In [30]:
# Slice the row labels 'Perry' to 'Potter': p_counties
p_counties = election["Perry":"Potter"]

# Print the p_counties DataFrame
print(p_counties)

# Slice the row labels 'Potter' to 'Perry' in reverse order: p_counties_rev
p_counties_rev = election.loc["Potter":"Perry":-1]

# Print the p_counties_rev DataFrame
print(p_counties_rev)

             state   total      Obama     Romney  winner   voters    turnout  \
county
Perry           PA   18240  29.769737  68.591009  Romney    27245  66.948064
Philadelphia    PA  653598  85.224251  14.051451   Obama  1099197  59.461407
Pike            PA   23164  43.904334  54.882576  Romney    41840  55.363289
Potter          PA    7205  26.259542  72.158223  Romney    10913  66.022175

                 margin
county
Perry         38.821272
Philadelphia  71.172800
Pike          10.978242
Potter        45.898681
             state   total      Obama     Romney  winner   voters    turnout  \
county
Potter          PA    7205  26.259542  72.158223  Romney    10913  66.022175
Pike            PA   23164  43.904334  54.882576  Romney    41840  55.363289
Philadelphia    PA  653598  85.224251  14.051451   Obama  1099197  59.461407
Perry           PA   18240  29.769737  68.591009  Romney    27245  66.948064

                 margin
county
Potter        45.898681
Pike          10.978242
Philadelphia  71.172800
Perry         38.821272

### slicing columns
Similar to row slicing, columns can be sliced by value. In this exercise, your job is to slice column names from the Pennsylvania election results DataFrame using .loc[].

It has been pre-loaded for you as election, with the index set to 'county'

- Slice the columns from the starting column to 'Obama' and assign the result to left_columns
- Slice the columns from 'Obama' to 'winner' and assign the result to middle_columns
- Slice the columns from 'Romney' to the end and assign the result to right_columns
- The code to print the first 5 rows of left_columns, middle_columns, and right_columns has been written, so hit 'Submit Answer' to see the results!

In [39]:
# Slice the columns from the starting column to 'Obama': left_columns
left_columns = election.loc[:,:"Obama"]

# Print the output of left_columns.head()
print(left_columns.head())

# Slice the columns from 'Obama' to 'winner': middle_columns
middle_columns = election.loc[:,"Obama":"winner"]

# Print the output of middle_columns.head()
print(middle_columns.head())

# Slice the columns from 'Romney' to the end: 'right_columns'
right_columns = election.loc[:,"Romney":]

# Print the output of right_columns.head()
print(right_columns.head())

          state   total      Obama
county
Adams        PA   41973  35.482334
Allegheny    PA  614671  56.640219
Armstrong    PA   28322  30.696985
Beaver       PA   80015  46.032619
Bedford      PA   21444  22.057452
               Obama     Romney  winner
county
Adams      35.482334  63.112001  Romney
Allegheny  56.640219  42.185820   Obama
Armstrong  30.696985  67.901278  Romney
Beaver     46.032619  52.637630  Romney
Bedford    22.057452  76.986570  Romney
              Romney  winner  voters    turnout     margin
county
Adams      63.112001  Romney   61156  68.632677  27.629667
Allegheny  42.185820   Obama  924351  66.497575  14.454399
Armstrong  67.901278  Romney   42147  67.198140  37.204293
Beaver     52.637630  Romney  115157  69.483401   6.605012
Bedford    76.986570  Romney   32189  66.619031  54.929118

### Subselecting DataFrames with lists
You can use lists to select specific row and column labels with the .loc[] accessor. In this exercise, your job is to select the counties ['Philadelphia', 'Centre', 'Fulton'] and the columns ['winner','Obama','Romney'] from the election DataFrame, which has been pre-loaded for you with the index set to 'county'.

- Create the list of row labels ['Philadelphia', 'Centre', 'Fulton'] and assign it to rows.
- Create the list of column labels ['winner', 'Obama', 'Romney'] and assign it to cols.
- Create a new DataFrame by selecting with rows and cols in .loc[] and assign it to three_counties.
- Print the three_counties DataFrame. This has been done for you, so hit 'Submit Answer` to see your new DataFrame.

In [41]:
# Create the list of row labels: rows
rows = ['Philadelphia', 'Centre', 'Fulton']

# Create the list of column labels: cols
cols = ['winner', 'Obama', 'Romney']

# Create the new DataFrame: three_counties
three_counties = election.loc[rows, cols]

# Print the three_counties DataFrame
print(three_counties)

              winner      Obama     Romney
county
Philadelphia   Obama  85.224251  14.051451
Centre        Romney  48.948416  48.977486
Fulton        Romney  21.096291  77.748861

## Filtering dataframes

1) creating a boolean series

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("sales.csv", index_col = "month")

In [4]:
df.salt > 60

month
Jan    False
Feb    False
Mar     True
Apr     True
May    False
Jun    False
Name: salt, dtype: bool

In [5]:
#how to use it?
df[df.salt > 60]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

In [8]:
#or
enough_salt_sold = df.salt > 60
df[enough_salt_sold]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

#### Combiling filters

In [10]:
df[(df.salt >= 50) & (df.eggs<200)]

       eggs  salt  spam
month
Feb     110  50.0    31
Apr      77  87.0    20

In [11]:
df[(df.salt >= 50) | (df.eggs<200)]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

### DataFrames with zeroes and NaNs

In [12]:
df2 = df.copy()

In [13]:
df2

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [14]:
df2['bacon'] = [0,0,50,60,70,80]

In [15]:
df2

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

#### Select columns with all non-zero values

In [16]:
df.loc[:,df2.all()]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

#### Selecting columns with any nonzeros

In [18]:
df2.loc[:, df2.any()]

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

#### Select column with any NaN

In [19]:
df.loc[:,df.isnull().any()]

       salt
month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0

#### select columns without NaNs

In [20]:
df.loc[:,df.notnull().all()]

       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72
Apr      77    20
May     132    52
Jun     205    55

#### Drop rows with NaN

In [22]:
df.dropna(how= "any")

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
Jun     205  60.0    55

#### Fiktering one column based on another

In [23]:
df.eggs[df.salt > 55]

month
Mar    221
Apr     77
Jun    205
Name: eggs, dtype: int64

#### Modifying a column based on another

In [24]:
df.eggs[df.salt > 55] +=5

D:\Programs\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [25]:
df.eggs

month
Jan     47
Feb    110
Mar    226
Apr     82
May    132
Jun    210
Name: eggs, dtype: int64

## Thresholding data
In this exercise, we have provided the Pennsylvania election results and included a column called 'turnout' that contains the percentage of voter turnout per county. Your job is to prepare a boolean array to select all of the rows and columns where voter turnout exceeded 70%.

As before, the DataFrame is available to you as election with the index set to 'county'.

- Create a boolean array of the condition where the 'turnout' column is greater than 70 and assign it to high_turnout.
- Filter the election DataFrame with the high_turnout array and assign it to high_turnout_df.

In [27]:
#import pandas as pd
filename = "pennsylvania2012_turnout.csv"
# Read in filename and set the index: election
election = pd.read_csv(filename, index_col='county')

In [28]:
election.columns

Index(['state', 'total', 'Obama', 'Romney', 'winner', 'voters', 'turnout',
       'margin'],
      dtype='object')

In [29]:
# Create the boolean array: high_turnout
high_turnout = election.turnout > 70

In [31]:

 # Filter the election DataFrame with the high_turnout array: high_turnout_df
high_turnout_df = election[high_turnout]

In [33]:

# Print the high_turnout_results DataFrame
high_turnout_df

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Bucks,PA,319407,49.966970,48.801686,Obama,435606,73.324748,1.165284
Butler,PA,88924,31.920516,66.816607,Romney,122762,72.436096,34.896091
Chester,PA,248295,49.228539,49.650617,Romney,337822,73.498766,0.422079
Forest,PA,2308,38.734835,59.835355,Romney,3232,71.410891,21.100520
Franklin,PA,62802,30.110506,68.583803,Romney,87406,71.850903,38.473297
Montgomery,PA,401787,56.637223,42.286834,Obama,551105,72.905708,14.350390
Westmoreland,PA,168709,37.567646,61.306154,Romney,238006,70.884347,23.738508

### Filtering columns using other columns
The election results DataFrame has a column labeled 'margin' which expresses the number of extra votes the winner received over the losing candidate. This number is given as a percentage of the total votes cast. It is reasonable to assume that in counties where this margin was less than 1%, the results would be too-close-to-call.

Your job is to use boolean selection to filter the rows where the margin was less than 1. You'll then convert these rows of the 'winner' column to np.nan to indicate that these results are too close to declare a winner.

The DataFrame has been pre-loaded for you as election.

In [34]:
import numpy as np

In [35]:
# Create the boolean array: too_close
too_close = election.margin < 1

In [37]:
# Assign np.nan to the 'winner' column where the results were too close to call
election.winner[too_close] = np.nan

D:\Programs\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [38]:
election.info()

<class 'pandas.core.frame.DataFrame'>
Index: 67 entries, Adams to York
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   state    67 non-null     object
 1   total    67 non-null     int64
 2   Obama    67 non-null     float64
 3   Romney   67 non-null     float64
 4   winner   64 non-null     object
 5   voters   67 non-null     int64
 6   turnout  67 non-null     float64
 7   margin   67 non-null     float64
dtypes: float64(4), int64(2), object(2)
memory usage: 7.2+ KB

### Filtering using NaNs
In certain scenarios, it may be necessary to remove rows and columns with missing data from a DataFrame. The .dropna() method is used to perform this action. You'll now practice using this method on a dataset obtained from Vanderbilt University, which consists of data from passengers on the Titanic.

The DataFrame has been pre-loaded for you as titanic. Explore it in the IPython Shell and you will note that there are many NaNs. You will focus specifically on the 'age' and 'cabin' columns in this exercise. Your job is to use .dropna() to remove rows where any of these two columns contains missing data and rows where all of these two columns contain missing data.

You'll also use the .shape attribute, which returns the number of rows and columns in a tuple from a DataFrame, or the number of rows from a Series, to see the effect of dropping missing values from a DataFrame.

Finally, you'll use the thresh= keyword argument to drop columns from the full dataset that have less than 1000 non-missing values.

- Select the 'age' and 'cabin' columns of titanic and create a new DataFrame df.
- Print the shape of df. This has been done for you.
- Drop rows in df with how='any' and print the shape.
- Drop rows in df with how='all' and print the shape.
- Drop columns from the titanic DataFrame that have less than 1000 non-missing values by specifying the thresh and axis keyword arguments. Print the output of .info() from this.

In [52]:
titanic = pd.read_csv("titanic.csv")

In [53]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [54]:
#selecting columns with any NaNs
titanic.loc[:,titanic.isnull().any()]

,age,fare,cabin,embarked,boat,body,home.dest
0,29.00,211.3375,B5,S,2,NaN,"St Louis, MO"
1,0.92,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,2.00,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,30.00,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,25.00,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...
1304,14.50,14.4542,NaN,C,NaN,328.0,NaN
1305,NaN,14.4542,NaN,C,NaN,NaN,NaN
1306,26.50,7.2250,NaN,C,NaN,304.0,NaN
1307,27.00,7.2250,NaN,C,NaN,NaN,NaN
1308,29.00,7.8750,NaN,S,NaN,NaN,NaN

In [55]:
df = titanic[["age", "cabin"]]

In [56]:
df.shape

(1309, 2)

In [57]:
df.dropna(how="any").shape

(272, 2)

In [58]:
df.dropna(how="all").shape

(1069, 2)

In [59]:
# Drop columns in titanic with less than 1000 non-missing values
#print(titanic.dropna(thresh=1000, axis='columns').info())
titanic.dropna(thresh=1000, axis='columns')

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,S
...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,C
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,C
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,C
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,C
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,S

In [60]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB